app/Http/Controllers/Managers/ChancellorController.php

select * from `departments`
select `doctors`.*, `department_doctor`.`department_id` as `pivot_department_id`, `department_doctor`.`doctor_id` as `pivot_doctor_id` from `doctors` inner join `department_doctor` on `doctors`.`id` = `department_doctor`.`doctor_id` where `department_doctor`.`department_id` in (1, 2, 3)
---
    public function index()
    {
        $this->authorize('isChancellor',new Manager);

        $departments = Department::all()->load('doctors');