app/Http/Controllers/Managers/ComplainsController.php

    public function index(ComplainsFilters $filters)
    {
        $complains = user()->isDean() ? Complain::filter($filters)->get() : user()->department->complains()->filter($filters)->get();
---
select * from `complains` where `complains`.`department_id` = 1 and `complains`.`department_id` is not null
select * from `departments` where `departments`.`manager_id` = 1 and `departments`.`manager_id` is not null limit 1