app/Http/Controllers/ComplainsController.php

    public function create()
    {
        $departments = Department::all();
---
select * from `departments`