app/Http/Controllers/QuestionnairesController.php

    public function create(Subject $subject)
    {
        $row = Db::table('registrations')->where('user_id', auth()->id())->where('subject_id', $subject->id)->first();
---
select * from `registrations` where `user_id` = 1 and `subject_id` = 2 limit 1