app/Http/Controllers/SubjectsController.php

select `subjects`.*, `registrations`.`user_id` as `pivot_user_id`, `registrations`.`subject_id` as `pivot_subject_id`, `registrations`.`doctor_id` as `pivot_doctor_id`, `registrations`.`assistant_id` as `pivot_assistant_id`, `registrations`.`group_id` as `pivot_group_id` from `subjects` inner join `registrations` on `subjects`.`id` = `registrations`.`subject_id` where `registrations`.`user_id` = 1
---
    public function index()
    {
        $student = auth()->user();

        $subjects = $student->subjects()->get();