app/Http/Controllers/Api/Managers/ComplainController.php

select * from `complains` where `complains`.`department_id` = 1 and `complains`.`department_id` is not null
select * from `departments` where `departments`.`manager_id` = 1 and `departments`.`manager_id` is not null limit 1
---
    public function index(ComplainsFilters $filters)
    {
        $complains = auth($this->guard)->user()->isDean() ? Complain::filter($filters)->get() : auth($this->guard)->user()->department->complains()->filter($filters)->get();